[A_UpliftingLight_Buff H7BaseBuff]
mName=""
mTooltip=""

[A_MasterOfLight_II_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="光系学识II"
mTooltip="%spell1.name 现在对目标3x3区域内的生物施放。%spell2.name 现在对目标4x4区域内的生物施放。"

[A_UpliftingLight_Buff_Leadership H7BaseBuff]
mName="振奋之光"
mTooltip=""

[A_UpliftingLight_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="振奋之光"
mTooltip="每施放一个光系法术，获得 %buff.buff.buff.buff.stat %buff.buff.buff.buff.stat.icon 领导力。持续到战斗结束。"

[A_LightScholar_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="光明学者"
mTooltip="光系法术的法力消耗降低 %special.norm%。"

[A_MasterOfLight_I_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="光系学识I"
mTooltip="%spell1.name 现在对目标4x4区域内的生物施放。\n%spell2.name 额外在 %spell2.spell.buff.buff.durnow 回合内降低命中生物的 %ICON_ATTACK 攻击和 %ICON_DEFENSE 防御 %spell2.spell.buff.buff.stat1.norm。"

[A_LightWisdom_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="光明智慧"
mTooltip="光系法术获得 %stat1 %stat1.icon 魔力。其他每个智慧类能力都会增加 %stat1 %stat1.icon 魔力到此加成中。"

[A_MasterOfLight_III_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="光系学识III"
mTooltip="%spell1.name 现在对目标4x4区域内的生物施放。\n%spell2.name 额外在 %spell2.spell.buff.buff.durini 回合内降低命中生物的 %ICON_ATTACK 攻击和 %ICON_DEFENSE 防御 %spell2.spell.buff.buff.stat1.norm。"

[A_BlindingLight_Ability H7HeroAbility]
mName="致盲闪光"
mTooltip="阳炎爆射和阳炎激射影响的生物有50%几率获得“致盲”减益，直到战斗回合结束前无法攻击。"
[A_ImprovedTier1Spells_Ability H7HeroAbility]
mName="光系学识I"
mTooltip="疗伤大法的目标为4x4区域内的所有友方生物。被阳炎激射伤害的队伍有50%几率变为“致盲”。"
[A_ImprovedTier2Spells_Ability H7HeroAbility]
mName="光系学识II"
mTooltip="天国护甲和净化之光的目标为3x3区域内的所有友方生物。"
[A_ImprovedTier3Spells_Ability H7HeroAbility]
mName="光系学识III"
mTooltip="如果被附魔的生物被敌方英雄的直接伤害法术击中，惩戒之术也会对最近的敌方生物造成伤害。被阳炎爆射伤害的队伍有50%几率变为“致盲”。"
[A_Justice_Ability H7HeroAbility]
mName="正义"
mTooltip="如果被附魔的生物被敌方英雄的直接伤害法术击中，惩戒之术也会对最近的敌方生物造成伤害。如果有多个生物距离相同，则随机选择目标。"
[A_MassCelestialArmor_Ability H7HeroAbility]
mName="群体护甲"
mTooltip="天国护甲的目标为3x3区域内的所有友方生物。"
[A_MassCleansing_Ability H7HeroAbility]
mName="群体净化"
mTooltip="净化之光的目标为4x4区域内的所有友方生物。"
[A_MassHeal_Ability H7HeroAbility]
mName="群体治疗"
mTooltip="疗伤大法的目标为4x4区域内的所有友方生物。"
[A_PiousCaster_Ability H7HeroAbility]
mName="虔诚施法者"
mTooltip="每施放一个光系法术+1领导力，直到战斗结束。上限为+10。"
[A_PiousCaster_Buff_Leadership H7BaseBuff]
mName="坚若盘石"
mTooltip="+ %stat 防御，直到战斗结束。"

v1.37

[A_ChosenOfTheLight_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="圣光之选"
mTooltip="每当英雄对友方生物施放正面光系法术时，它获得\n%buff.buff.stat1 %ICON_ATTACK 攻击\n%buff.buff.stat2 %ICON_DEFENSE 防御\n%buff.buff.stat4 %ICON_MORALE 士气\n%buff.buff.stat3 %ICON_LUCK 幸运\n并造成最大伤害，直到其下一回合。\n如果英雄拥有所需知识，则有几率学会一个新的4级光系法术。"

v1.41

[A_LightMagic_Skill H7Skill]
mName="光系魔法"
mTooltip="允许你在魔法行会学习光系魔法学派的法术。改善并增强其效果。"
mDescriptions[0]="使光系法术更有效，并提高英雄的 %ICON_ARCANE_KNOWLEDGE 魔力。"
mDescriptions[1]=""
mDescriptions[2]="使光系法术更有效，并将英雄的 %ICON_ARCANE_KNOWLEDGE 魔力提高1点。\n英雄有几率学会一个新的1级光系法术。"
mDescriptions[3]="使光系法术更有效，并将英雄的 %ICON_ARCANE_KNOWLEDGE 魔力额外提高2点。\n如果英雄拥有所需知识，则有几率学会一个新的2级光系法术。"
mDescriptions[4]="使光系法术更有效，并将英雄的 %ICON_ARCANE_KNOWLEDGE 魔力额外提高3点。\n如果英雄拥有所需知识，则有几率学会一个新的3级光系法术。\n\n与大师级<font color="#00588BFF">领导</font>结合时，解锁<font color="#00FFCB44">协同能力</font>：闪耀士气。\n\n与大师级<font color="#00588BFF">典范</font>结合时，解锁<font color="#00FFCB44">协同能力</font>：奥丁召唤。"